# Pandas Library

The pandas library is used for working with data in the form of tables, time series or datasets. Loading and saving data from different sources (csv, xlsx, sql database ...).

Provides highly optimized data structures for data analysis.

We will use it for data exploration and data modification (ETL process).

Pandas uses numpy library in the background to work with multidimensional data. We'll look at that later.

Installation using pip: **pip install pandas**

In [1]:
import pandas as pd

## Loading data from CSV

In [2]:
salary = pd.read_csv ("..\\dataset\\salary_dataset.csv")

Data display

In [3]:
salary

    YearsExperience  Salary
0               1.1    1979
1               1.3    2498
2               1.5    1857
3               2.0    2295
4               2.2    2020
5               2.9    3288
6               3.0    3554
7               3.2    3122
8               3.2    3879
9               3.7    3330
10              3.9    3786
11              4.0    3924
12              4.0    4812
13              4.1    3922
14              4.5    5627
15              4.9    4844
16              5.1    4699
17              5.3    5791
18              5.9    5960
19              6.0    6912
20              6.8    6646
21              7.1    6940
22              7.9    6670
23              8.2    7617
24              8.7    7285
25              9.0    6994
26              9.5    7856
27              9.6    7528
28             10.3    8266
29             10.5    8227

## Reading data from excel
For this functionality you need to install the openpyxl library: **pip install openpyxl**

In [4]:
customers = pd.read_excel ("..\\dataset\\mall_customers.xlsx")

Displaying part of the data

In [5]:
customers

    Age  Annual Income (k$)  Spending Score (1-100)
0    19                  15                      39
1    21                  15                      81
2    64                  19                       3
3    67                  19                      14
4    37                  20                      13
..  ...                 ...                     ...
83   28                 101                      68
84   33                 113                       8
85   32                 126                      74
86   32                 137                      18
87   30                 137                      83

[88 rows x 3 columns]

## Reading data from Sqlite3 database using SQL query

In [6]:
import sqlite3
cur = sqlite3.connect ("..\\dataset\\database.db")
points = pd.read_sql_query ("SELECT * FROM points", cur)
points

     NAME  CATEGORY  POINTS  ID        DATE
0   Novák         1    10.0   1  2020-01-10
1  Dvořák         1    15.0   2  2020-10-05
2   Tučný         1     7.0   3  2021-05-31
3  Prokop         2     9.0   4  2021-06-28
4   Kovář         2     1.0   5  2023-07-08
5    Brož         2    25.0   6  2021-06-15
6  Dlouhý         3     6.0   7  2023-08-10
7  Blažek         3     NaN   8  2023-12-31

## Change data format and export
Sometimes it can be useful to read structured data in one format and want to convert it to another format.

For example, poitns was read from sqlite3 and we need to work with it in JSON.

In [7]:
points.to_json()

'{"NAME":{"0":"Nov\\u00e1k","1":"Dvo\\u0159\\u00e1k","2":"Tu\\u010dn\\u00fd","3":"Prokop","4":"Kov\\u00e1\\u0159","5":"Bro\\u017e","6":"Dlouh\\u00fd","7":"Bla\\u017eek"},"CATEGORY":{"0":1,"1":1,"2":1,"3":2,"4":2,"5":2,"6":3,"7":3},"POINTS":{"0":10.0,"1":15.0,"2":7.0,"3":9.0,"4":1.0,"5":25.0,"6":6.0,"7":null},"ID":{"0":1,"1":2,"2":3,"3":4,"4":5,"5":6,"6":7,"7":8},"DATE":{"0":"2020-01-10","1":"2020-10-05","2":"2021-05-31","3":"2021-06-28","4":"2023-07-08","5":"2021-06-15","6":"2023-08-10","7":"2023-12-31"}}'

Or save them to a csv file.

In [8]:
points.to_csv("..\\dataset\\database.csv")

If we want to put them into XML, we need to have the lxml library installed: **pip install lxml**

In [9]:
points.to_xml()

"<?xml version='1.0' encoding='utf-8'?>\n<data>\n  <row>\n    <index>0</index>\n    <NAME>Novák</NAME>\n    <CATEGORY>1</CATEGORY>\n    <POINTS>10.0</POINTS>\n    <ID>1</ID>\n    <DATE>2020-01-10</DATE>\n  </row>\n  <row>\n    <index>1</index>\n    <NAME>Dvořák</NAME>\n    <CATEGORY>1</CATEGORY>\n    <POINTS>15.0</POINTS>\n    <ID>2</ID>\n    <DATE>2020-10-05</DATE>\n  </row>\n  <row>\n    <index>2</index>\n    <NAME>Tučný</NAME>\n    <CATEGORY>1</CATEGORY>\n    <POINTS>7.0</POINTS>\n    <ID>3</ID>\n    <DATE>2021-05-31</DATE>\n  </row>\n  <row>\n    <index>3</index>\n    <NAME>Prokop</NAME>\n    <CATEGORY>2</CATEGORY>\n    <POINTS>9.0</POINTS>\n    <ID>4</ID>\n    <DATE>2021-06-28</DATE>\n  </row>\n  <row>\n    <index>4</index>\n    <NAME>Kovář</NAME>\n    <CATEGORY>2</CATEGORY>\n    <POINTS>1.0</POINTS>\n    <ID>5</ID>\n    <DATE>2023-07-08</DATE>\n  </row>\n  <row>\n    <index>5</index>\n    <NAME>Brož</NAME>\n    <CATEGORY>2</CATEGORY>\n    <POINTS>25.0</POINTS>\n    <ID>6</ID>\n    <DATE>2021-06-15</DATE>\n  </row>\n  <row>\n    <index>6</index>\n    <NAME>Dlouhý</NAME>\n    <CATEGORY>3</CATEGORY>\n    <POINTS>6.0</POINTS>\n    <ID>7</ID>\n    <DATE>2023-08-10</DATE>\n  </row>\n  <row>\n    <index>7</index>\n    <NAME>Blažek</NAME>\n    <CATEGORY>3</CATEGORY>\n    <POINTS/>\n    <ID>8</ID>\n    <DATE>2023-12-31</DATE>\n  </row>\n</data>"

## Structure of read data
Pandas returns the DataFrame data type when it is read. 

DataFrame is the main object of pandas, it resembles an Excel table or SQL table.
* Each column can have a different data type.
* Each row has an index that can be customized.

A DataFrame consists of
- Series - column of data 
- columns - a list of columns of type Index. Column names can be edited
- index - table rows

In [10]:
type(points)

pandas.core.frame.DataFrame

We can list the dataset structure using info.

In [11]:
points.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   NAME      8 non-null      object
 1   CATEGORY  8 non-null      int64
 2   POINTS    7 non-null      float64
 3   ID        8 non-null      int64
 4   DATE      8 non-null      object
dtypes: float64(1), int64(2), object(2)
memory usage: 452.0+ bytes

### Series
The values are stored using the numpy library. We will use it later.

We can access the column by its name and it can be seen that it is of type Series.

In [12]:
points["NAME"]

0     Novák
1    Dvořák
2     Tučný
3    Prokop
4     Kovář
5      Brož
6    Dlouhý
7    Blažek
Name: NAME, dtype: object

It is also possible to select subsets of columns. A subset is defined as a list []

In [13]:
points[["NAME", "CATEGORY"]]

     NAME  CATEGORY
0   Novák         1
1  Dvořák         1
2   Tučný         1
3  Prokop         2
4   Kovář         2
5    Brož         2
6  Dlouhý         3
7  Blažek         3

In [14]:
type(points["NAME"])

pandas.core.series.Series

### Columns
columns is a DataFrame attribute that contains a list of all column names.

In [15]:
points.columns

Index(['NAME', 'CATEGORY', 'POINTS', 'ID', 'DATE'], dtype='object')

In [16]:
type(points.columns)

pandas.core.indexes.base.Index

Columns can be renamed. Renaming is done by editing the dictionary entry
* inplace = False, the column is renamed within the output
* inplace = True, rename within the dataset installation

In [17]:
points.rename(columns={"CATEGORY":"Category"})

     NAME  Category  POINTS  ID        DATE
0   Novák         1    10.0   1  2020-01-10
1  Dvořák         1    15.0   2  2020-10-05
2   Tučný         1     7.0   3  2021-05-31
3  Prokop         2     9.0   4  2021-06-28
4   Kovář         2     1.0   5  2023-07-08
5    Brož         2    25.0   6  2021-06-15
6  Dlouhý         3     6.0   7  2023-08-10
7  Blažek         3     NaN   8  2023-12-31

In [18]:
points.columns

Index(['NAME', 'CATEGORY', 'POINTS', 'ID', 'DATE'], dtype='object')

So if we want to rename a column permanently, we need to use inplace=True

In [19]:
points.rename(columns={"CATEGORY":"Category"}, inplace=True)

In [20]:
points.columns

Index(['NAME', 'Category', 'POINTS', 'ID', 'DATE'], dtype='object')

### Index
In pandas, Index is a basic object that represents an index of rows or columns in a DataFrame or Series.

Each DataFrame has a row index (df.index) and a column index (df.columns)

Both are instances of the pandas.core.indexes.base.Index class (or its subclasses, such as RangeIndex)

In [21]:
points.index

RangeIndex(start=0, stop=8, step=1)

Data are indexed according to an internal index starting from 0.

In [22]:
points

     NAME  Category  POINTS  ID        DATE
0   Novák         1    10.0   1  2020-01-10
1  Dvořák         1    15.0   2  2020-10-05
2   Tučný         1     7.0   3  2021-05-31
3  Prokop         2     9.0   4  2021-06-28
4   Kovář         2     1.0   5  2023-07-08
5    Brož         2    25.0   6  2021-06-15
6  Dlouhý         3     6.0   7  2023-08-10
7  Blažek         3     NaN   8  2023-12-31

If you don't want to use an internally generated index, but want to use a column as an index, this can be set.

In [23]:
points.set_index("ID", inplace=True)

In [24]:
# data are indexed by column ID from 1. 
points

      NAME  Category  POINTS        DATE
ID
1    Novák         1    10.0  2020-01-10
2   Dvořák         1    15.0  2020-10-05
3    Tučný         1     7.0  2021-05-31
4   Prokop         2     9.0  2021-06-28
5    Kovář         2     1.0  2023-07-08
6     Brož         2    25.0  2021-06-15
7   Dlouhý         3     6.0  2023-08-10
8   Blažek         3     NaN  2023-12-31

In [25]:
points.index

Index([1, 2, 3, 4, 5, 6, 7, 8], dtype='int64', name='ID')

Sometimes it is necessary to use a date column as an index. Then you can select dates according to a specified time span (year, quarter).

In [26]:
points.set_index("DATE", inplace=True)

In [27]:
points

              NAME  Category  POINTS
DATE
2020-01-10   Novák         1    10.0
2020-10-05  Dvořák         1    15.0
2021-05-31   Tučný         1     7.0
2021-06-28  Prokop         2     9.0
2023-07-08   Kovář         2     1.0
2021-06-15    Brož         2    25.0
2023-08-10  Dlouhý         3     6.0
2023-12-31  Blažek         3     NaN

DATE is set as Index.

In [28]:
points.index

Index(['2020-01-10', '2020-10-05', '2021-05-31', '2021-06-28', '2023-07-08',
       '2021-06-15', '2023-08-10', '2023-12-31'],
      dtype='object', name='DATE')

For time functions it is necessary to set them as DatetimeIndex.

In [29]:
points.index = pd.to_datetime(points.index)

In [30]:
points.index

DatetimeIndex(['2020-01-10', '2020-10-05', '2021-05-31', '2021-06-28',
               '2023-07-08', '2021-06-15', '2023-08-10', '2023-12-31'],
              dtype='datetime64[ns]', name='DATE', freq=None)

 With a time index we can select records from a certain range.

 sort_index() is used to select by sorted list.

In [31]:

points.sort_index().loc["2020-01-01" : "2020-12-31"]

              NAME  Category  POINTS
DATE
2020-01-10   Novák         1    10.0
2020-10-05  Dvořák         1    15.0

## Data samples
If the dataset is very large, its display may be unclear. Pandas have functions to display parts of the data.
* head - first records
* tail - last records
* sample - random records

In [32]:
points.head(5)

              NAME  Category  POINTS
DATE
2020-01-10   Novák         1    10.0
2020-10-05  Dvořák         1    15.0
2021-05-31   Tučný         1     7.0
2021-06-28  Prokop         2     9.0
2023-07-08   Kovář         2     1.0

In [33]:
points.tail(3)

              NAME  Category  POINTS
DATE
2021-06-15    Brož         2    25.0
2023-08-10  Dlouhý         3     6.0
2023-12-31  Blažek         3     NaN

In [34]:
points.sample(5)

              NAME  Category  POINTS
DATE
2020-01-10   Novák         1    10.0
2023-07-08   Kovář         2     1.0
2021-06-28  Prokop         2     9.0
2020-10-05  Dvořák         1    15.0
2021-06-15    Brož         2    25.0

## Data access

### Iteration over columns
The items() method returns a view (view object) on pairs (key, value) in the dictionary.

In [35]:
for key, values in points.items():
    print (key, values)

NAME DATE
2020-01-10     Novák
2020-10-05    Dvořák
2021-05-31     Tučný
2021-06-28    Prokop
2023-07-08     Kovář
2021-06-15      Brož
2023-08-10    Dlouhý
2023-12-31    Blažek
Name: NAME, dtype: object
Category DATE
2020-01-10    1
2020-10-05    1
2021-05-31    1
2021-06-28    2
2023-07-08    2
2021-06-15    2
2023-08-10    3
2023-12-31    3
Name: Category, dtype: int64
POINTS DATE
2020-01-10    10.0
2020-10-05    15.0
2021-05-31     7.0
2021-06-28     9.0
2023-07-08     1.0
2021-06-15    25.0
2023-08-10     6.0
2023-12-31     NaN
Name: POINTS, dtype: float64

### Data selection by columns

In [36]:
points[["NAME", "POINTS"]]

              NAME  POINTS
DATE
2020-01-10   Novák    10.0
2020-10-05  Dvořák    15.0
2021-05-31   Tučný     7.0
2021-06-28  Prokop     9.0
2023-07-08   Kovář     1.0
2021-06-15    Brož    25.0
2023-08-10  Dlouhý     6.0
2023-12-31  Blažek     NaN

### Row selection by index
The loc method is used for this purpose.

In [37]:
points.loc['2020-01-10']

NAME        Novák
Category        1
POINTS       10.0
Name: 2020-01-10 00:00:00, dtype: object

In [38]:
points.loc['2021']

              NAME  Category  POINTS
DATE
2021-05-31   Tučný         1     7.0
2021-06-28  Prokop         2     9.0
2021-06-15    Brož         2    25.0

### Row selection by numeric index (order)
To select a row by order in the dataset, use **iloc**.
* Index order from 0
* Negative numbers index from the end
* Only a specific range can be selected
* Xth multiples can be selected

In [39]:
points.iloc[0]

NAME        Novák
Category        1
POINTS       10.0
Name: 2020-01-10 00:00:00, dtype: object

In [40]:
points.iloc[-1]

NAME        Blažek
Category         3
POINTS         NaN
Name: 2023-12-31 00:00:00, dtype: object

In [41]:
points.iloc[2:4]

              NAME  Category  POINTS
DATE
2021-05-31   Tučný         1     7.0
2021-06-28  Prokop         2     9.0

In [42]:
# every 3.
points.iloc[::3]

              NAME  Category  POINTS
DATE
2020-01-10   Novák         1    10.0
2021-06-28  Prokop         2     9.0
2023-08-10  Dlouhý         3     6.0

### Combination of column and row selection
* For loc, columns and index values are entered
* For iloc, row indexes and column indexes are entered

In [43]:
points.loc["2021", "POINTS"]

DATE
2021-05-31     7.0
2021-06-28     9.0
2021-06-15    25.0
Name: POINTS, dtype: float64

In [44]:
sum(points.loc["2021", "POINTS"])

41.0

In [45]:
points.iloc[0, 0:3]

NAME        Novák
Category        1
POINTS       10.0
Name: 2020-01-10 00:00:00, dtype: object

### Selection by condition
The condition returns True and False values for the given indexes to indicate whether the record meets the condition.

In [46]:
points["Category"] == 2

DATE
2020-01-10    False
2020-10-05    False
2021-05-31    False
2021-06-28     True
2023-07-08     True
2021-06-15     True
2023-08-10    False
2023-12-31    False
Name: Category, dtype: bool

The result of the condition is then used to select rows.

In [47]:
points[points["Category"] == 2]

              NAME  Category  POINTS
DATE
2021-06-28  Prokop         2     9.0
2023-07-08   Kovář         2     1.0
2021-06-15    Brož         2    25.0

The conditions may be more complex. For a logical OR expression, the | character is used.

In [48]:
points[(points["Category"] == 2) | (points["POINTS"] > 8)]

              NAME  Category  POINTS
DATE
2020-01-10   Novák         1    10.0
2020-10-05  Dvořák         1    15.0
2021-06-28  Prokop         2     9.0
2023-07-08   Kovář         2     1.0
2021-06-15    Brož         2    25.0

For the logical expression AND, & is used.

In [49]:
points[(points["Category"] == 2) & (points["POINTS"] > 8)]

              NAME  Category  POINTS
DATE
2021-06-28  Prokop         2     9.0
2021-06-15    Brož         2    25.0

## Applying the function to data
In some cases, the underlying data must be processed and a function must be applied to it to return a new value.

For example, the function scores test results with a grade.

In [50]:
import numpy as np
def grade(points):
    if np.isnan(points) : return np.nan
    elif 0 < points < 8 : return "D"
    elif 8 <= points <= 12 : return "C"
    elif 12 <= points <= 16 : return "B"
    else : return "A"

In [51]:
points

              NAME  Category  POINTS
DATE
2020-01-10   Novák         1    10.0
2020-10-05  Dvořák         1    15.0
2021-05-31   Tučný         1     7.0
2021-06-28  Prokop         2     9.0
2023-07-08   Kovář         2     1.0
2021-06-15    Brož         2    25.0
2023-08-10  Dlouhý         3     6.0
2023-12-31  Blažek         3     NaN

In [52]:
points["grade"]=points["POINTS"].apply(grade)

In [53]:
points

              NAME  Category  POINTS grade
DATE
2020-01-10   Novák         1    10.0     C
2020-10-05  Dvořák         1    15.0     B
2021-05-31   Tučný         1     7.0     D
2021-06-28  Prokop         2     9.0     C
2023-07-08   Kovář         2     1.0     D
2021-06-15    Brož         2    25.0     A
2023-08-10  Dlouhý         3     6.0     D
2023-12-31  Blažek         3     NaN   NaN

## Basic statistics
After reading data from a file, you often want to get an idea of the data by basic statistics (minimum, maximum, count, standard deviation, etc.)

This is what the **describe** function is for.

In [54]:
points.describe()

       Category     POINTS
count  8.000000   7.000000
mean   1.875000  10.428571
std    0.834523   7.699722
min    1.000000   1.000000
25%    1.000000   6.500000
50%    2.000000   9.000000
75%    2.250000  12.500000
max    3.000000  25.000000

The pandas library got many statistical functions that you can run on selected data.

In [55]:
print (points["POINTS"].mean())

10.428571428571429

In [56]:
print (points["POINTS"].min())

1.0

## NaN values
Similarly to NULL values in databases, a dataset can contain NaN, i.e. unknown value.

Sometimes it is advisable to remove incomplete records so that they do not invalidate statistics or interfere with the learning process.

The function dopna, deletes incomplete records.

In [57]:
points2=points.dropna(inplace=False)
points2

              NAME  Category  POINTS grade
DATE
2020-01-10   Novák         1    10.0     C
2020-10-05  Dvořák         1    15.0     B
2021-05-31   Tučný         1     7.0     D
2021-06-28  Prokop         2     9.0     C
2023-07-08   Kovář         2     1.0     D
2021-06-15    Brož         2    25.0     A
2023-08-10  Dlouhý         3     6.0     D

Sometimes we may not want to delete incomplete records, but we want to fill in the missing values with some value, such as the average value in a column.

In [58]:
points["POINTS"].fillna(points["POINTS"].mean(), inplace=True)

In [59]:
points

              NAME  Category     POINTS grade
DATE
2020-01-10   Novák         1  10.000000     C
2020-10-05  Dvořák         1  15.000000     B
2021-05-31   Tučný         1   7.000000     D
2021-06-28  Prokop         2   9.000000     C
2023-07-08   Kovář         2   1.000000     D
2021-06-15    Brož         2  25.000000     A
2023-08-10  Dlouhý         3   6.000000     D
2023-12-31  Blažek         3  10.428571   NaN

Supplementation is always advisable. Is a student who hasn't taken the test really supposed to have a C average?

In [60]:
points["grade"]=points["POINTS"].apply(grade)

In [61]:
points

              NAME  Category     POINTS grade
DATE
2020-01-10   Novák         1  10.000000     C
2020-10-05  Dvořák         1  15.000000     B
2021-05-31   Tučný         1   7.000000     D
2021-06-28  Prokop         2   9.000000     C
2023-07-08   Kovář         2   1.000000     D
2021-06-15    Brož         2  25.000000     A
2023-08-10  Dlouhý         3   6.000000     D
2023-12-31  Blažek         3  10.428571     C